XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/mm_glb_reg.h
/* 0x44 : sw_reset_mm_peri */
#define MM_GLB_SW_RESET_MM_PERI_OFFSET (0x44)
#define MM_GLB_SWRST_MM_MISC           MM_GLB_SWRST_MM_MISC
#define MM_GLB_SWRST_MM_MISC_POS       (0U)
#define MM_GLB_SWRST_MM_MISC_LEN       (1U)
#define MM_GLB_SWRST_MM_MISC_MSK       (((1U << MM_GLB_SWRST_MM_MISC_LEN) - 1) << MM_GLB_SWRST_MM_MISC_POS)
#define MM_GLB_SWRST_MM_MISC_UMSK      (~(((1U << MM_GLB_SWRST_MM_MISC_LEN) - 1) << MM_GLB_SWRST_MM_MISC_POS))
#define MM_GLB_SWRST_DMA               MM_GLB_SWRST_DMA
#define MM_GLB_SWRST_DMA_POS           (1U)
#define MM_GLB_SWRST_DMA_LEN           (1U)
#define MM_GLB_SWRST_DMA_MSK           (((1U << MM_GLB_SWRST_DMA_LEN) - 1) << MM_GLB_SWRST_DMA_POS)
#define MM_GLB_SWRST_DMA_UMSK          (~(((1U << MM_GLB_SWRST_DMA_LEN) - 1) << MM_GLB_SWRST_DMA_POS))
#define MM_GLB_SWRST_UART0             MM_GLB_SWRST_UART0
#define MM_GLB_SWRST_UART0_POS         (2U)
#define MM_GLB_SWRST_UART0_LEN         (1U)
#define MM_GLB_SWRST_UART0_MSK         (((1U << MM_GLB_SWRST_UART0_LEN) - 1) << MM_GLB_SWRST_UART0_POS)
#define MM_GLB_SWRST_UART0_UMSK        (~(((1U << MM_GLB_SWRST_UART0_LEN) - 1) << MM_GLB_SWRST_UART0_POS))
#define MM_GLB_SWRST_I2C0              MM_GLB_SWRST_I2C0
#define MM_GLB_SWRST_I2C0_POS          (3U)
#define MM_GLB_SWRST_I2C0_LEN          (1U)
#define MM_GLB_SWRST_I2C0_MSK          (((1U << MM_GLB_SWRST_I2C0_LEN) - 1) << MM_GLB_SWRST_I2C0_POS)
#define MM_GLB_SWRST_I2C0_UMSK         (~(((1U << MM_GLB_SWRST_I2C0_LEN) - 1) << MM_GLB_SWRST_I2C0_POS))
#define MM_GLB_SWRST_I2C1              MM_GLB_SWRST_I2C1
#define MM_GLB_SWRST_I2C1_POS          (4U)
#define MM_GLB_SWRST_I2C1_LEN          (1U)
#define MM_GLB_SWRST_I2C1_MSK          (((1U << MM_GLB_SWRST_I2C1_LEN) - 1) << MM_GLB_SWRST_I2C1_POS)
#define MM_GLB_SWRST_I2C1_UMSK         (~(((1U << MM_GLB_SWRST_I2C1_LEN) - 1) << MM_GLB_SWRST_I2C1_POS))
#define MM_GLB_SWRST_IPC               MM_GLB_SWRST_IPC
#define MM_GLB_SWRST_IPC_POS           (5U)
#define MM_GLB_SWRST_IPC_LEN           (1U)
#define MM_GLB_SWRST_IPC_MSK           (((1U << MM_GLB_SWRST_IPC_LEN) - 1) << MM_GLB_SWRST_IPC_POS)
#define MM_GLB_SWRST_IPC_UMSK          (~(((1U << MM_GLB_SWRST_IPC_LEN) - 1) << MM_GLB_SWRST_IPC_POS))
#define MM_GLB_SWRST_DMA2D             MM_GLB_SWRST_DMA2D
#define MM_GLB_SWRST_DMA2D_POS         (6U)
#define MM_GLB_SWRST_DMA2D_LEN         (1U)
#define MM_GLB_SWRST_DMA2D_MSK         (((1U << MM_GLB_SWRST_DMA2D_LEN) - 1) << MM_GLB_SWRST_DMA2D_POS)
#define MM_GLB_SWRST_DMA2D_UMSK        (~(((1U << MM_GLB_SWRST_DMA2D_LEN) - 1) << MM_GLB_SWRST_DMA2D_POS))
#define MM_GLB_SWRST_SPI               MM_GLB_SWRST_SPI
#define MM_GLB_SWRST_SPI_POS           (8U)
#define MM_GLB_SWRST_SPI_LEN           (1U)
#define MM_GLB_SWRST_SPI_MSK           (((1U << MM_GLB_SWRST_SPI_LEN) - 1) << MM_GLB_SWRST_SPI_POS)
#define MM_GLB_SWRST_SPI_UMSK          (~(((1U << MM_GLB_SWRST_SPI_LEN) - 1) << MM_GLB_SWRST_SPI_POS))
#define MM_GLB_SWRST_TIMER             MM_GLB_SWRST_TIMER
#define MM_GLB_SWRST_TIMER_POS         (9U)
#define MM_GLB_SWRST_TIMER_LEN         (1U)
#define MM_GLB_SWRST_TIMER_MSK         (((1U << MM_GLB_SWRST_TIMER_LEN) - 1) << MM_GLB_SWRST_TIMER_POS)
#define MM_GLB_SWRST_TIMER_UMSK        (~(((1U << MM_GLB_SWRST_TIMER_LEN) - 1) << MM_GLB_SWRST_TIMER_POS))
#define MM_GLB_SWRST_I2S0              MM_GLB_SWRST_I2S0
#define MM_GLB_SWRST_I2S0_POS          (10U)
#define MM_GLB_SWRST_I2S0_LEN          (1U)
#define MM_GLB_SWRST_I2S0_MSK          (((1U << MM_GLB_SWRST_I2S0_LEN) - 1) << MM_GLB_SWRST_I2S0_POS)
#define MM_GLB_SWRST_I2S0_UMSK         (~(((1U << MM_GLB_SWRST_I2S0_LEN) - 1) << MM_GLB_SWRST_I2S0_POS))
#define MM_GLB_SWRST_I2S1              MM_GLB_SWRST_I2S1
#define MM_GLB_SWRST_I2S1_POS          (11U)
#define MM_GLB_SWRST_I2S1_LEN          (1U)
#define MM_GLB_SWRST_I2S1_MSK          (((1U << MM_GLB_SWRST_I2S1_LEN) - 1) << MM_GLB_SWRST_I2S1_POS)
#define MM_GLB_SWRST_I2S1_UMSK         (~(((1U << MM_GLB_SWRST_I2S1_LEN) - 1) << MM_GLB_SWRST_I2S1_POS))
#define MM_GLB_SWRST_PDM0              MM_GLB_SWRST_PDM0
#define MM_GLB_SWRST_PDM0_POS          (12U)
#define MM_GLB_SWRST_PDM0_LEN          (1U)
#define MM_GLB_SWRST_PDM0_MSK          (((1U << MM_GLB_SWRST_PDM0_LEN) - 1) << MM_GLB_SWRST_PDM0_POS)
#define MM_GLB_SWRST_PDM0_UMSK         (~(((1U << MM_GLB_SWRST_PDM0_LEN) - 1) << MM_GLB_SWRST_PDM0_POS))
#define MM_GLB_SWRST_PDM1              MM_GLB_SWRST_PDM1
#define MM_GLB_SWRST_PDM1_POS          (13U)
#define MM_GLB_SWRST_PDM1_LEN          (1U)
#define MM_GLB_SWRST_PDM1_MSK          (((1U << MM_GLB_SWRST_PDM1_LEN) - 1) << MM_GLB_SWRST_PDM1_POS)
#define MM_GLB_SWRST_PDM1_UMSK         (~(((1U << MM_GLB_SWRST_PDM1_LEN) - 1) << MM_GLB_SWRST_PDM1_POS))
#define MM_GLB_SWRST_UART1             MM_GLB_SWRST_UART1
#define MM_GLB_SWRST_UART1_POS         (14U)
#define MM_GLB_SWRST_UART1_LEN         (1U)
#define MM_GLB_SWRST_UART1_MSK         (((1U << MM_GLB_SWRST_UART1_LEN) - 1) << MM_GLB_SWRST_UART1_POS)
#define MM_GLB_SWRST_UART1_UMSK        (~(((1U << MM_GLB_SWRST_UART1_LEN) - 1) << MM_GLB_SWRST_UART1_POS))
#define MM_GLB_SWRST_PUHS              MM_GLB_SWRST_PUHS
#define MM_GLB_SWRST_PUHS_POS          (15U)
#define MM_GLB_SWRST_PUHS_LEN          (1U)
#define MM_GLB_SWRST_PUHS_MSK          (((1U << MM_GLB_SWRST_PUHS_LEN) - 1) << MM_GLB_SWRST_PUHS_POS)
#define MM_GLB_SWRST_PUHS_UMSK         (~(((1U << MM_GLB_SWRST_PUHS_LEN) - 1) << MM_GLB_SWRST_PUHS_POS))

/* 0x48 : sw_reset_isp_sub */
#define MM_GLB_SW_RESET_ISP_SUB_OFFSET (0x48)
#define MM_GLB_SWRST_ISP_MISC          MM_GLB_SWRST_ISP_MISC
#define MM_GLB_SWRST_ISP_MISC_POS      (0U)
#define MM_GLB_SWRST_ISP_MISC_LEN      (1U)
#define MM_GLB_SWRST_ISP_MISC_MSK      (((1U << MM_GLB_SWRST_ISP_MISC_LEN) - 1) << MM_GLB_SWRST_ISP_MISC_POS)
#define MM_GLB_SWRST_ISP_MISC_UMSK     (~(((1U << MM_GLB_SWRST_ISP_MISC_LEN) - 1) << MM_GLB_SWRST_ISP_MISC_POS))
#define MM_GLB_SWRST_ISP_MAIN          MM_GLB_SWRST_ISP_MAIN
#define MM_GLB_SWRST_ISP_MAIN_POS      (1U)
#define MM_GLB_SWRST_ISP_MAIN_LEN      (1U)
#define MM_GLB_SWRST_ISP_MAIN_MSK      (((1U << MM_GLB_SWRST_ISP_MAIN_LEN) - 1) << MM_GLB_SWRST_ISP_MAIN_POS)
#define MM_GLB_SWRST_ISP_MAIN_UMSK     (~(((1U << MM_GLB_SWRST_ISP_MAIN_LEN) - 1) << MM_GLB_SWRST_ISP_MAIN_POS))
#define MM_GLB_SWRST_ISP_TSRC          MM_GLB_SWRST_ISP_TSRC
#define MM_GLB_SWRST_ISP_TSRC_POS      (2U)
#define MM_GLB_SWRST_ISP_TSRC_LEN      (1U)
#define MM_GLB_SWRST_ISP_TSRC_MSK      (((1U << MM_GLB_SWRST_ISP_TSRC_LEN) - 1) << MM_GLB_SWRST_ISP_TSRC_POS)
#define MM_GLB_SWRST_ISP_TSRC_UMSK     (~(((1U << MM_GLB_SWRST_ISP_TSRC_LEN) - 1) << MM_GLB_SWRST_ISP_TSRC_POS))
#define MM_GLB_SWRST_DP_TSRC           MM_GLB_SWRST_DP_TSRC
#define MM_GLB_SWRST_DP_TSRC_POS       (3U)
#define MM_GLB_SWRST_DP_TSRC_LEN       (1U)
#define MM_GLB_SWRST_DP_TSRC_MSK       (((1U << MM_GLB_SWRST_DP_TSRC_LEN) - 1) << MM_GLB_SWRST_DP_TSRC_POS)
#define MM_GLB_SWRST_DP_TSRC_UMSK      (~(((1U << MM_GLB_SWRST_DP_TSRC_LEN) - 1) << MM_GLB_SWRST_DP_TSRC_POS))
#define MM_GLB_SWRST_NR3D_CTRL         MM_GLB_SWRST_NR3D_CTRL
#define MM_GLB_SWRST_NR3D_CTRL_POS     (4U)
#define MM_GLB_SWRST_NR3D_CTRL_LEN     (1U)
#define MM_GLB_SWRST_NR3D_CTRL_MSK     (((1U << MM_GLB_SWRST_NR3D_CTRL_LEN) - 1) << MM_GLB_SWRST_NR3D_CTRL_POS)
#define MM_GLB_SWRST_NR3D_CTRL_UMSK    (~(((1U << MM_GLB_SWRST_NR3D_CTRL_LEN) - 1) << MM_GLB_SWRST_NR3D_CTRL_POS))
#define MM_GLB_SWRST_DVP2BUSA          MM_GLB_SWRST_DVP2BUSA
#define MM_GLB_SWRST_DVP2BUSA_POS      (5U)
#define MM_GLB_SWRST_DVP2BUSA_LEN      (1U)
#define MM_GLB_SWRST_DVP2BUSA_MSK      (((1U << MM_GLB_SWRST_DVP2BUSA_LEN) - 1) << MM_GLB_SWRST_DVP2BUSA_POS)
#define MM_GLB_SWRST_DVP2BUSA_UMSK     (~(((1U << MM_GLB_SWRST_DVP2BUSA_LEN) - 1) << MM_GLB_SWRST_DVP2BUSA_POS))
#define MM_GLB_SWRST_DVP2BUSB          MM_GLB_SWRST_DVP2BUSB
#define MM_GLB_SWRST_DVP2BUSB_POS      (6U)
#define MM_GLB_SWRST_DVP2BUSB_LEN      (1U)
#define MM_GLB_SWRST_DVP2BUSB_MSK      (((1U << MM_GLB_SWRST_DVP2BUSB_LEN) - 1) << MM_GLB_SWRST_DVP2BUSB_POS)
#define MM_GLB_SWRST_DVP2BUSB_UMSK     (~(((1U << MM_GLB_SWRST_DVP2BUSB_LEN) - 1) << MM_GLB_SWRST_DVP2BUSB_POS))
#define MM_GLB_SWRST_DVP2BUSC          MM_GLB_SWRST_DVP2BUSC
#define MM_GLB_SWRST_DVP2BUSC_POS      (7U)
#define MM_GLB_SWRST_DVP2BUSC_LEN      (1U)
#define MM_GLB_SWRST_DVP2BUSC_MSK      (((1U << MM_GLB_SWRST_DVP2BUSC_LEN) - 1) << MM_GLB_SWRST_DVP2BUSC_POS)
#define MM_GLB_SWRST_DVP2BUSC_UMSK     (~(((1U << MM_GLB_SWRST_DVP2BUSC_LEN) - 1) << MM_GLB_SWRST_DVP2BUSC_POS))
#define MM_GLB_SWRST_DVP2BUSD          MM_GLB_SWRST_DVP2BUSD
#define MM_GLB_SWRST_DVP2BUSD_POS      (8U)
#define MM_GLB_SWRST_DVP2BUSD_LEN      (1U)
#define MM_GLB_SWRST_DVP2BUSD_MSK      (((1U << MM_GLB_SWRST_DVP2BUSD_LEN) - 1) << MM_GLB_SWRST_DVP2BUSD_POS)
#define MM_GLB_SWRST_DVP2BUSD_UMSK     (~(((1U << MM_GLB_SWRST_DVP2BUSD_LEN) - 1) << MM_GLB_SWRST_DVP2BUSD_POS))
#define MM_GLB_SWRST_MIPI              MM_GLB_SWRST_MIPI
#define MM_GLB_SWRST_MIPI_POS          (9U)
#define MM_GLB_SWRST_MIPI_LEN          (1U)
#define MM_GLB_SWRST_MIPI_MSK          (((1U << MM_GLB_SWRST_MIPI_LEN) - 1) << MM_GLB_SWRST_MIPI_POS)
#define MM_GLB_SWRST_MIPI_UMSK         (~(((1U << MM_GLB_SWRST_MIPI_LEN) - 1) << MM_GLB_SWRST_MIPI_POS))
#define MM_GLB_SWRST_ISP_REG           MM_GLB_SWRST_ISP_REG
#define MM_GLB_SWRST_ISP_REG_POS       (16U)
#define MM_GLB_SWRST_ISP_REG_LEN       (1U)
#define MM_GLB_SWRST_ISP_REG_MSK       (((1U << MM_GLB_SWRST_ISP_REG_LEN) - 1) << MM_GLB_SWRST_ISP_REG_POS)
#define MM_GLB_SWRST_ISP_REG_UMSK      (~(((1U << MM_GLB_SWRST_ISP_REG_LEN) - 1) << MM_GLB_SWRST_ISP_REG_POS))
#define MM_GLB_SWRST_DVP2BUSE          MM_GLB_SWRST_DVP2BUSE
#define MM_GLB_SWRST_DVP2BUSE_POS      (17U)
#define MM_GLB_SWRST_DVP2BUSE_LEN      (1U)
#define MM_GLB_SWRST_DVP2BUSE_MSK      (((1U << MM_GLB_SWRST_DVP2BUSE_LEN) - 1) << MM_GLB_SWRST_DVP2BUSE_POS)
#define MM_GLB_SWRST_DVP2BUSE_UMSK     (~(((1U << MM_GLB_SWRST_DVP2BUSE_LEN) - 1) << MM_GLB_SWRST_DVP2BUSE_POS))
#define MM_GLB_SWRST_DVP2BUSF          MM_GLB_SWRST_DVP2BUSF
#define MM_GLB_SWRST_DVP2BUSF_POS      (18U)
#define MM_GLB_SWRST_DVP2BUSF_LEN      (1U)
#define MM_GLB_SWRST_DVP2BUSF_MSK      (((1U << MM_GLB_SWRST_DVP2BUSF_LEN) - 1) << MM_GLB_SWRST_DVP2BUSF_POS)
#define MM_GLB_SWRST_DVP2BUSF_UMSK     (~(((1U << MM_GLB_SWRST_DVP2BUSF_LEN) - 1) << MM_GLB_SWRST_DVP2BUSF_POS))
#define MM_GLB_SWRST_DVP2BUSG          MM_GLB_SWRST_DVP2BUSG
#define MM_GLB_SWRST_DVP2BUSG_POS      (19U)
#define MM_GLB_SWRST_DVP2BUSG_LEN      (1U)
#define MM_GLB_SWRST_DVP2BUSG_MSK      (((1U << MM_GLB_SWRST_DVP2BUSG_LEN) - 1) << MM_GLB_SWRST_DVP2BUSG_POS)
#define MM_GLB_SWRST_DVP2BUSG_UMSK     (~(((1U << MM_GLB_SWRST_DVP2BUSG_LEN) - 1) << MM_GLB_SWRST_DVP2BUSG_POS))
#define MM_GLB_SWRST_DVP2BUSH          MM_GLB_SWRST_DVP2BUSH
#define MM_GLB_SWRST_DVP2BUSH_POS      (20U)
#define MM_GLB_SWRST_DVP2BUSH_LEN      (1U)
#define MM_GLB_SWRST_DVP2BUSH_MSK      (((1U << MM_GLB_SWRST_DVP2BUSH_LEN) - 1) << MM_GLB_SWRST_DVP2BUSH_POS)
#define MM_GLB_SWRST_DVP2BUSH_UMSK     (~(((1U << MM_GLB_SWRST_DVP2BUSH_LEN) - 1) << MM_GLB_SWRST_DVP2BUSH_POS))

/* 0x4C : sw_reset_codec_sub */
#define MM_GLB_SW_RESET_CODEC_SUB_OFFSET (0x4C)
#define MM_GLB_SWRST_CODEC_MISC          MM_GLB_SWRST_CODEC_MISC
#define MM_GLB_SWRST_CODEC_MISC_POS      (0U)
#define MM_GLB_SWRST_CODEC_MISC_LEN      (1U)
#define MM_GLB_SWRST_CODEC_MISC_MSK      (((1U << MM_GLB_SWRST_CODEC_MISC_LEN) - 1) << MM_GLB_SWRST_CODEC_MISC_POS)
#define MM_GLB_SWRST_CODEC_MISC_UMSK     (~(((1U << MM_GLB_SWRST_CODEC_MISC_LEN) - 1) << MM_GLB_SWRST_CODEC_MISC_POS))
#define MM_GLB_SWRST_MJPEG               MM_GLB_SWRST_MJPEG
#define MM_GLB_SWRST_MJPEG_POS           (1U)
#define MM_GLB_SWRST_MJPEG_LEN           (1U)
#define MM_GLB_SWRST_MJPEG_MSK           (((1U << MM_GLB_SWRST_MJPEG_LEN) - 1) << MM_GLB_SWRST_MJPEG_POS)
#define MM_GLB_SWRST_MJPEG_UMSK          (~(((1U << MM_GLB_SWRST_MJPEG_LEN) - 1) << MM_GLB_SWRST_MJPEG_POS))
#define MM_GLB_SWRST_H264                MM_GLB_SWRST_H264
#define MM_GLB_SWRST_H264_POS            (2U)
#define MM_GLB_SWRST_H264_LEN            (1U)
#define MM_GLB_SWRST_H264_MSK            (((1U << MM_GLB_SWRST_H264_LEN) - 1) << MM_GLB_SWRST_H264_POS)
#define MM_GLB_SWRST_H264_UMSK           (~(((1U << MM_GLB_SWRST_H264_LEN) - 1) << MM_GLB_SWRST_H264_POS))
#define MM_GLB_SWRST_MJPEG_DEC           MM_GLB_SWRST_MJPEG_DEC
#define MM_GLB_SWRST_MJPEG_DEC_POS       (3U)
#define MM_GLB_SWRST_MJPEG_DEC_LEN       (1U)
#define MM_GLB_SWRST_MJPEG_DEC_MSK       (((1U << MM_GLB_SWRST_MJPEG_DEC_LEN) - 1) << MM_GLB_SWRST_MJPEG_DEC_POS)
#define MM_GLB_SWRST_MJPEG_DEC_UMSK      (~(((1U << MM_GLB_SWRST_MJPEG_DEC_LEN) - 1) << MM_GLB_SWRST_MJPEG_DEC_POS))
#define MM_GLB_SWRST_CNN                 MM_GLB_SWRST_CNN
#define MM_GLB_SWRST_CNN_POS             (4U)
#define MM_GLB_SWRST_CNN_LEN             (1U)
#define MM_GLB_SWRST_CNN_MSK             (((1U << MM_GLB_SWRST_CNN_LEN) - 1) << MM_GLB_SWRST_CNN_POS)
#define MM_GLB_SWRST_CNN_UMSK            (~(((1U << MM_GLB_SWRST_CNN_LEN) - 1) << MM_GLB_SWRST_CNN_POS))
#define MM_GLB_SWRST_VRAM                MM_GLB_SWRST_VRAM
#define MM_GLB_SWRST_VRAM_POS            (16U)
#define MM_GLB_SWRST_VRAM_LEN            (1U)
#define MM_GLB_SWRST_VRAM_MSK            (((1U << MM_GLB_SWRST_VRAM_LEN) - 1) << MM_GLB_SWRST_VRAM_POS)
#define MM_GLB_SWRST_VRAM_UMSK           (~(((1U << MM_GLB_SWRST_VRAM_LEN) - 1) << MM_GLB_SWRST_VRAM_POS))

/* 0x50 : image_sensor_ctrl */
#define MM_GLB_IMAGE_SENSOR_CTRL_OFFSET (0x50)
#define MM_GLB_RG_IS_RST_N              MM_GLB_RG_IS_RST_N
#define MM_GLB_RG_IS_RST_N_POS          (0U)
#define MM_GLB_RG_IS_RST_N_LEN          (1U)
#define MM_GLB_RG_IS_RST_N_MSK          (((1U << MM_GLB_RG_IS_RST_N_LEN) - 1) << MM_GLB_RG_IS_RST_N_POS)
#define MM_GLB_RG_IS_RST_N_UMSK         (~(((1U << MM_GLB_RG_IS_RST_N_LEN) - 1) << MM_GLB_RG_IS_RST_N_POS))

