XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/mm_glb_reg.h
/* 0x60 : tz_mm_clkrst */
#define MM_GLB_TZ_MM_CLKRST_OFFSET         (0x60)
#define MM_GLB_TZC_MM_SWRST_LOCK           MM_GLB_TZC_MM_SWRST_LOCK
#define MM_GLB_TZC_MM_SWRST_LOCK_POS       (0U)
#define MM_GLB_TZC_MM_SWRST_LOCK_LEN       (1U)
#define MM_GLB_TZC_MM_SWRST_LOCK_MSK       (((1U << MM_GLB_TZC_MM_SWRST_LOCK_LEN) - 1) << MM_GLB_TZC_MM_SWRST_LOCK_POS)
#define MM_GLB_TZC_MM_SWRST_LOCK_UMSK      (~(((1U << MM_GLB_TZC_MM_SWRST_LOCK_LEN) - 1) << MM_GLB_TZC_MM_SWRST_LOCK_POS))
#define MM_GLB_TZC_MM_SYS_RESET_LOCK       MM_GLB_TZC_MM_SYS_RESET_LOCK
#define MM_GLB_TZC_MM_SYS_RESET_LOCK_POS   (1U)
#define MM_GLB_TZC_MM_SYS_RESET_LOCK_LEN   (1U)
#define MM_GLB_TZC_MM_SYS_RESET_LOCK_MSK   (((1U << MM_GLB_TZC_MM_SYS_RESET_LOCK_LEN) - 1) << MM_GLB_TZC_MM_SYS_RESET_LOCK_POS)
#define MM_GLB_TZC_MM_SYS_RESET_LOCK_UMSK  (~(((1U << MM_GLB_TZC_MM_SYS_RESET_LOCK_LEN) - 1) << MM_GLB_TZC_MM_SYS_RESET_LOCK_POS))
#define MM_GLB_TZC_MM_PWRON_RST_LOCK       MM_GLB_TZC_MM_PWRON_RST_LOCK
#define MM_GLB_TZC_MM_PWRON_RST_LOCK_POS   (2U)
#define MM_GLB_TZC_MM_PWRON_RST_LOCK_LEN   (1U)
#define MM_GLB_TZC_MM_PWRON_RST_LOCK_MSK   (((1U << MM_GLB_TZC_MM_PWRON_RST_LOCK_LEN) - 1) << MM_GLB_TZC_MM_PWRON_RST_LOCK_POS)
#define MM_GLB_TZC_MM_PWRON_RST_LOCK_UMSK  (~(((1U << MM_GLB_TZC_MM_PWRON_RST_LOCK_LEN) - 1) << MM_GLB_TZC_MM_PWRON_RST_LOCK_POS))
#define MM_GLB_TZC_MM_CPU0_RESET_LOCK      MM_GLB_TZC_MM_CPU0_RESET_LOCK
#define MM_GLB_TZC_MM_CPU0_RESET_LOCK_POS  (3U)
#define MM_GLB_TZC_MM_CPU0_RESET_LOCK_LEN  (1U)
#define MM_GLB_TZC_MM_CPU0_RESET_LOCK_MSK  (((1U << MM_GLB_TZC_MM_CPU0_RESET_LOCK_LEN) - 1) << MM_GLB_TZC_MM_CPU0_RESET_LOCK_POS)
#define MM_GLB_TZC_MM_CPU0_RESET_LOCK_UMSK (~(((1U << MM_GLB_TZC_MM_CPU0_RESET_LOCK_LEN) - 1) << MM_GLB_TZC_MM_CPU0_RESET_LOCK_POS))
#define MM_GLB_TZC_MM_CLK_LOCK             MM_GLB_TZC_MM_CLK_LOCK
#define MM_GLB_TZC_MM_CLK_LOCK_POS         (4U)
#define MM_GLB_TZC_MM_CLK_LOCK_LEN         (1U)
#define MM_GLB_TZC_MM_CLK_LOCK_MSK         (((1U << MM_GLB_TZC_MM_CLK_LOCK_LEN) - 1) << MM_GLB_TZC_MM_CLK_LOCK_POS)
#define MM_GLB_TZC_MM_CLK_LOCK_UMSK        (~(((1U << MM_GLB_TZC_MM_CLK_LOCK_LEN) - 1) << MM_GLB_TZC_MM_CLK_LOCK_POS))

struct mm_glb_reg {
    /* 0x0 : mm_clk_ctrl_cpu */
    union {
        struct {
            uint32_t reg_pll_en               : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_cpu_clk_en           : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_bclk_en              : 1; /* [    2],        r/w,        0x1 */
            uint32_t reg_mm_cpu_clk_en        : 1; /* [    3],        r/w,        0x1 */
            uint32_t reg_uart_clk_sel         : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t reg_i2c_clk_sel          : 1; /* [    6],        r/w,        0x0 */
            uint32_t reg_spi_clk_sel          : 1; /* [    7],        r/w,        0x0 */
            uint32_t reg_cpu_clk_sel          : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reg_xclk_clk_sel         : 1; /* [   10],        r/w,        0x0 */
            uint32_t reg_cpu_root_clk_sel     : 1; /* [   11],        r/w,        0x0 */
            uint32_t reg_mmcpu0_clk_en        : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg_bclk1x_sel           : 2; /* [14:13],        r/w,        0x0 */
            uint32_t reserved_15_17           : 3; /* [17:15],       rsvd,        0x0 */
            uint32_t reg_bclk2x_div_act_pulse : 1; /* [   18],        w1p,        0x0 */
            uint32_t reg_bclk2x_div_bypass    : 1; /* [   19],        r/w,        0x0 */
            uint32_t sts_bclk2x_prot_done     : 1; /* [   20],          r,        0x1 */
            uint32_t reserved_21_23           : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t reg_bclk2x_sw_done_cnt   : 4; /* [27:24],        r/w,        0x5 */
            uint32_t cpu_clk_sw_state         : 3; /* [30:28],          r,        0x0 */
            uint32_t reserved_31              : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_clk_ctrl_cpu;

    /* 0x4 : mm_clk_cpu */
    union {
        struct {
            uint32_t reg_cpu_clk_div    : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_cnn_clk_div_en : 1; /* [    8],        r/w,        0x1 */
            uint32_t reg_cnn_clk_sel    : 2; /* [10: 9],        r/w,        0x0 */
            uint32_t reserved_11        : 1; /* [   11],       rsvd,        0x0 */
            uint32_t reg_cnn_clk_div    : 3; /* [14:12],        r/w,        0x0 */
            uint32_t reserved_15        : 1; /* [   15],       rsvd,        0x0 */
            uint32_t reg_bclk2x_div     : 8; /* [23:16],        r/w,        0x0 */
            uint32_t reg_bclk1x_div     : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_clk_cpu;

    /* 0x8 : isp_dp_clk */
    union {
        struct {
            uint32_t reg_isp_clk_div_en : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_isp_clk_sel    : 2; /* [ 2: 1],        r/w,        0x0 */
            uint32_t reserved_3_7       : 5; /* [ 7: 3],       rsvd,        0x0 */
            uint32_t reg_isp_clk_div    : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t reg_dp_clk_div_en  : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_dp_clk_sel     : 1; /* [   17],        r/w,        0x0 */
            uint32_t reserved_18_19     : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t reg_dp_clk_div     : 4; /* [23:20],        r/w,        0x0 */
            uint32_t reserved_24_31     : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } isp_dp_clk;

    /* 0xC : codec_clk */
    union {
        struct {
            uint32_t reserved_0_7        : 8;  /* [ 7: 0],       rsvd,        0x0 */
            uint32_t reg_h264_clk_div_en : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reg_h264_clk_sel    : 2;  /* [10: 9],        r/w,        0x0 */
            uint32_t reserved_11         : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t reg_h264_clk_div    : 3;  /* [14:12],        r/w,        0x0 */
            uint32_t reserved_15_31      : 17; /* [31:15],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } codec_clk;

    /* 0x10 : mm_clk_ctrl_peri */
    union {
        struct {
            uint32_t reg_i2c0_clk_div     : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_i2c0_clk_div_en  : 1; /* [    8],        r/w,        0x1 */
            uint32_t reg_i2c0_clk_en      : 1; /* [    9],        r/w,        0x1 */
            uint32_t reserved_10_15       : 6; /* [15:10],       rsvd,        0x0 */
            uint32_t reg_uart0_clk_div_en : 1; /* [   16],        r/w,        0x1 */
            uint32_t reg_uart0_clk_div    : 3; /* [19:17],        r/w,        0x0 */
            uint32_t reserved_20_22       : 3; /* [22:20],       rsvd,        0x0 */
            uint32_t reg_spi_clk_div_en   : 1; /* [   23],        r/w,        0x1 */
            uint32_t reg_spi_clk_div      : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_clk_ctrl_peri;

    /* 0x14  reserved */
    uint8_t RESERVED0x14[4];

    /* 0x18 : mm_clk_ctrl_peri3 */
    union {
        struct {
            uint32_t reg_i2c1_clk_div     : 8;  /* [ 7: 0],        r/w,        0x0 */
            uint32_t reg_i2c1_clk_div_en  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reg_i2c1_clk_en      : 1;  /* [    9],        r/w,        0x1 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t reg_uart1_clk_div_en : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reg_uart1_clk_div    : 3;  /* [19:17],        r/w,        0x0 */
            uint32_t reserved_20_31       : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_clk_ctrl_peri3;

    /* 0x1c  reserved */
    uint8_t RESERVED0x1c[36];

    /* 0x40 : mm_sw_sys_reset */
    union {
        struct {
            uint32_t reg_ctrl_sys_reset    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1            : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t reg_ctrl_pwron_rst    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_7          : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t reg_ctrl_mmcpu0_reset : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31         : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mm_sw_sys_reset;

